tom38121605/rd_00_base/RD_00_语言_算法/IIS-卡车司机算法-k/SMonitor_prj_270_frm_255c_af_flexuart_SD5做tx_AD0做rx_ok_keep/devices/MIMXRT1011/drivers/fsl_flexio_uart.c
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_flexio_uart.h"

#include "fsl_debug_console.h"

volatile uint8_t flg_flrx=0;
volatile uint8_t iflrxcount=0;
volatile uint8_t iflrxcount2=0;
volatile uint8_t iflrxdata[10]={0};
volatile uint8_t iflrxdata2[10]={0};


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.flexio_uart"
#endif

/*<! @brief uart transfer state. */
enum _flexio_uart_transfer_states
{
    kFLEXIO_UART_TxIdle, /* TX idle. */
    kFLEXIO_UART_TxBusy, /* TX busy. */
    kFLEXIO_UART_RxIdle, /* RX idle. */
    kFLEXIO_UART_RxBusy  /* RX busy. */
};

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Get the length of received data in RX ring buffer.
 *
 * @param handle FLEXIO UART handle pointer.
 * @return Length of received data in RX ring buffer.
 */
static size_t FLEXIO_UART_TransferGetRxRingBufferLength(flexio_uart_handle_t *handle);

/*!
 * @brief Check whether the RX ring buffer is full.
 *
 * @param handle FLEXIO UART handle pointer.
 * @retval true  RX ring buffer is full.
 * @retval false RX ring buffer is not full.
 */
static bool FLEXIO_UART_TransferIsRxRingBufferFull(flexio_uart_handle_t *handle);

/*******************************************************************************
 * Codes
 ******************************************************************************/

static uint32_t FLEXIO_UART_GetInstance(FLEXIO_UART_Type *base)
{
    return FLEXIO_GetInstance(base->flexioBase);
}

static size_t FLEXIO_UART_TransferGetRxRingBufferLength(flexio_uart_handle_t *handle)
{
    size_t size;
    uint16_t rxRingBufferHead = handle->rxRingBufferHead;
    uint16_t rxRingBufferTail = handle->rxRingBufferTail;

    if (rxRingBufferTail > rxRingBufferHead)
    {
        size = (size_t)rxRingBufferHead + handle->rxRingBufferSize - (size_t)rxRingBufferTail;
    }
    else
    {
        size = (size_t)rxRingBufferHead - (size_t)rxRingBufferTail;
    }

    return size;
}

static bool FLEXIO_UART_TransferIsRxRingBufferFull(flexio_uart_handle_t *handle)
{
    bool full;

    if (FLEXIO_UART_TransferGetRxRingBufferLength(handle) == (handle->rxRingBufferSize - 1U))
    {
        full = true;
    }
    else
    {
        full = false;
    }

    return full;
}

/*!
 * brief Ungates the FlexIO clock, resets the FlexIO module, configures FlexIO UART
 * hardware, and configures the FlexIO UART with FlexIO UART configuration.
 * The configuration structure can be filled by the user or be set with
 * default values by FLEXIO_UART_GetDefaultConfig().
 *
 * Example
   code
   FLEXIO_UART_Type base = {
   .flexioBase = FLEXIO,
   .TxPinIndex = 0,
   .RxPinIndex = 1,
   .shifterIndex = {0,1},
   .timerIndex = {0,1}
   };
   flexio_uart_config_t config = {
   .enableInDoze = false,
   .enableInDebug = true,
   .enableFastAccess = false,
   .baudRate_Bps = 115200U,
   .bitCountPerChar = 8
   };
   FLEXIO_UART_Init(base, &config, srcClock_Hz);
   endcode
 *
 * param base Pointer to the FLEXIO_UART_Type structure.
 * param userConfig Pointer to the flexio_uart_config_t structure.
 * param srcClock_Hz FlexIO source clock in Hz.
 * retval kStatus_Success Configuration success.
 * retval kStatus_FLEXIO_UART_BaudrateNotSupport Baudrate is not supported for current clock source frequency.
*/
status_t FLEXIO_UART_Init(FLEXIO_UART_Type *base, const flexio_uart_config_t *userConfig, uint32_t srcClock_Hz)   //org
{
    assert((base != NULL) && (userConfig != NULL));

    flexio_shifter_config_t shifterConfig;
    flexio_timer_config_t timerConfig;
    uint32_t ctrlReg  = 0;
    uint16_t timerDiv = 0;
    uint16_t timerCmp = 0;
    uint32_t calculatedBaud;
    uint32_t diff;
    status_t result = kStatus_Success;

    /* Clear the shifterConfig & timerConfig struct. */
    (void)memset(&shifterConfig, 0, sizeof(shifterConfig));
    (void)memset(&timerConfig, 0, sizeof(timerConfig));

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate flexio clock. */
    CLOCK_EnableClock(s_flexioClocks[FLEXIO_UART_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Configure FLEXIO UART */
    ctrlReg = base->flexioBase->CTRL;
    ctrlReg &= ~(FLEXIO_CTRL_DOZEN_MASK | FLEXIO_CTRL_DBGE_MASK | FLEXIO_CTRL_FASTACC_MASK | FLEXIO_CTRL_FLEXEN_MASK);
    ctrlReg |= (FLEXIO_CTRL_DBGE(userConfig->enableInDebug) | FLEXIO_CTRL_FASTACC(userConfig->enableFastAccess) |
                FLEXIO_CTRL_FLEXEN(userConfig->enableUart));
    if (!userConfig->enableInDoze)
    {
        ctrlReg |= FLEXIO_CTRL_DOZEN_MASK;
    }

    base->flexioBase->CTRL = ctrlReg;
    
 
////    /* Do hardware configuration. */
////    /* 1. Configure the shifter 0 for tx. */
////    shifterConfig.timerSelect   = base->timerIndex[0];
////    shifterConfig.timerPolarity = kFLEXIO_ShifterTimerPolarityOnPositive;
////    shifterConfig.pinConfig     = kFLEXIO_PinConfigOutput;
////    shifterConfig.pinSelect     = base->TxPinIndex;
////    shifterConfig.pinPolarity   = kFLEXIO_PinActiveHigh;
////    shifterConfig.shifterMode   = kFLEXIO_ShifterModeTransmit;
////    shifterConfig.inputSource   = kFLEXIO_ShifterInputFromPin;
////    shifterConfig.shifterStop   = kFLEXIO_ShifterStopBitHigh;
////    shifterConfig.shifterStart  = kFLEXIO_ShifterStartBitLow;

////    FLEXIO_SetShifterConfig(base->flexioBase, base->shifterIndex[0], &shifterConfig);

////    /*2. Configure the timer 0 for tx. */
////    timerConfig.triggerSelect   = FLEXIO_TIMER_TRIGGER_SEL_SHIFTnSTAT(base->shifterIndex[0]);
////    timerConfig.triggerPolarity = kFLEXIO_TimerTriggerPolarityActiveLow;
////    timerConfig.triggerSource   = kFLEXIO_TimerTriggerSourceInternal;
////    timerConfig.pinConfig       = kFLEXIO_PinConfigOutputDisabled;
////    timerConfig.pinSelect       = base->TxPinIndex;
////    timerConfig.pinPolarity     = kFLEXIO_PinActiveHigh;
////    timerConfig.timerMode       = kFLEXIO_TimerModeDual8BitBaudBit;
////    timerConfig.timerOutput     = kFLEXIO_TimerOutputOneNotAffectedByReset;
////    timerConfig.timerDecrement  = kFLEXIO_TimerDecSrcOnFlexIOClockShiftTimerOutput;
////    timerConfig.timerReset      = kFLEXIO_TimerResetNever;
////    timerConfig.timerDisable    = kFLEXIO_TimerDisableOnTimerCompare;
////    timerConfig.timerEnable     = kFLEXIO_TimerEnableOnTriggerHigh;
////    timerConfig.timerStop       = kFLEXIO_TimerStopBitEnableOnTimerDisable;
////    timerConfig.timerStart      = kFLEXIO_TimerStartBitEnabled;

////    timerDiv = (uint16_t)(srcClock_Hz / userConfig->baudRate_Bps);
////    timerDiv = timerDiv / 2U - 1U;

////    if (timerDiv > 0xFFU)
////    {
////        /* Check whether the calculated timerDiv is within allowed range. */
////        return kStatus_FLEXIO_UART_BaudrateNotSupport;
////    }
////    else
////    {
////        /* Check to see if actual baud rate is within 3% of desired baud rate
////         * based on the best calculated timerDiv value */
////        calculatedBaud = srcClock_Hz / (((uint32_t)timerDiv + 1U) * 2U);
////        /* timerDiv cannot be larger than the ideal divider, so calculatedBaud is definitely larger
////           than configured baud */
////        diff = calculatedBaud - userConfig->baudRate_Bps;
////        if (diff > ((userConfig->baudRate_Bps / 100U) * 3U))
////        {
////            return kStatus_FLEXIO_UART_BaudrateNotSupport;
////        }
////    }

////    timerCmp = ((uint16_t)userConfig->bitCountPerChar * 2U - 1U) << 8U;
////    timerCmp |= timerDiv;

////    timerConfig.timerCompare = timerCmp;

