tom38121605/rd_00_base/RD_00_语言_算法/IIS-卡车司机算法-k/SMonitor_prj_270_frm_255c_af_flexuart_SD5做tx_AD0做rx_ok_keep/devices/MIMXRT1011/drivers/fsl_flexio_uart.c
////    FLEXIO_SetTimerConfig(base->flexioBase, base->timerIndex[0], &timerConfig);

////    /* 3. Configure the shifter 1 for rx. */
////    shifterConfig.timerSelect   = base->timerIndex[1];
////    shifterConfig.timerPolarity = kFLEXIO_ShifterTimerPolarityOnNegitive;
////    shifterConfig.pinConfig     = kFLEXIO_PinConfigOutputDisabled;
////    shifterConfig.pinSelect     = base->RxPinIndex;
////    shifterConfig.pinPolarity   = kFLEXIO_PinActiveHigh;
////    shifterConfig.shifterMode   = kFLEXIO_ShifterModeReceive;
////    shifterConfig.inputSource   = kFLEXIO_ShifterInputFromPin;
////    shifterConfig.shifterStop   = kFLEXIO_ShifterStopBitHigh;
////    shifterConfig.shifterStart  = kFLEXIO_ShifterStartBitLow;

////    FLEXIO_SetShifterConfig(base->flexioBase, base->shifterIndex[1], &shifterConfig);

////    /* 4. Configure the timer 1 for rx. */
////    timerConfig.triggerSelect   = FLEXIO_TIMER_TRIGGER_SEL_PININPUT(base->RxPinIndex);
////    timerConfig.triggerPolarity = kFLEXIO_TimerTriggerPolarityActiveHigh;
////    timerConfig.triggerSource   = kFLEXIO_TimerTriggerSourceExternal;
////    timerConfig.pinConfig       = kFLEXIO_PinConfigOutputDisabled;
////    timerConfig.pinSelect       = base->RxPinIndex;
////    timerConfig.pinPolarity     = kFLEXIO_PinActiveLow;
////    timerConfig.timerMode       = kFLEXIO_TimerModeDual8BitBaudBit;
////    timerConfig.timerOutput     = kFLEXIO_TimerOutputOneAffectedByReset;
////    timerConfig.timerDecrement  = kFLEXIO_TimerDecSrcOnFlexIOClockShiftTimerOutput;
////    timerConfig.timerReset      = kFLEXIO_TimerResetOnTimerPinRisingEdge;
////    timerConfig.timerDisable    = kFLEXIO_TimerDisableOnTimerCompare;
////    timerConfig.timerEnable     = kFLEXIO_TimerEnableOnPinRisingEdge;
////    timerConfig.timerStop       = kFLEXIO_TimerStopBitEnableOnTimerDisable;
////    timerConfig.timerStart      = kFLEXIO_TimerStartBitEnabled;

////    timerConfig.timerCompare = timerCmp;

////    FLEXIO_SetTimerConfig(base->flexioBase, base->timerIndex[1], &timerConfig);

    return result;
}

status_t FLEXIO_UART_Init_tx(FLEXIO_UART_Type *base, const flexio_uart_config_t *userConfig, uint32_t srcClock_Hz)  
{
    assert((base != NULL) && (userConfig != NULL));

    flexio_shifter_config_t shifterConfig;
    flexio_timer_config_t timerConfig;
    uint32_t ctrlReg  = 0;
    uint16_t timerDiv = 0;
    uint16_t timerCmp = 0;
    uint32_t calculatedBaud;
    uint32_t diff;
    status_t result = kStatus_Success;

    /* Clear the shifterConfig & timerConfig struct. */
    (void)memset(&shifterConfig, 0, sizeof(shifterConfig));
    (void)memset(&timerConfig, 0, sizeof(timerConfig));

    
//----------------------------------------------
    
    timerDiv = (uint16_t)(srcClock_Hz / userConfig->baudRate_Bps);
    timerDiv = timerDiv / 2U - 1U;
    
    if (timerDiv > 0xFFU)
    {
        /* Check whether the calculated timerDiv is within allowed range. */
        return kStatus_FLEXIO_UART_BaudrateNotSupport;
    }
    else
    {
        /* Check to see if actual baud rate is within 3% of desired baud rate
         * based on the best calculated timerDiv value */
        calculatedBaud = srcClock_Hz / (((uint32_t)timerDiv + 1U) * 2U);
        /* timerDiv cannot be larger than the ideal divider, so calculatedBaud is definitely larger
           than configured baud */
        diff = calculatedBaud - userConfig->baudRate_Bps;
        if (diff > ((userConfig->baudRate_Bps / 100U) * 3U))
        {
            return kStatus_FLEXIO_UART_BaudrateNotSupport;
        }
    }

    timerCmp = ((uint16_t)userConfig->bitCountPerChar * 2U - 1U) << 8U;
    timerCmp |= timerDiv;
  
    

    /* Do hardware configuration. */
    /* 1. Configure the shifter 0 for tx. */
    shifterConfig.timerSelect   = base->timerIndex[0];
    shifterConfig.timerPolarity = kFLEXIO_ShifterTimerPolarityOnPositive;
    shifterConfig.pinConfig     = kFLEXIO_PinConfigOutput;
    shifterConfig.pinSelect     = base->TxPinIndex;
    shifterConfig.pinPolarity   = kFLEXIO_PinActiveHigh;
    shifterConfig.shifterMode   = kFLEXIO_ShifterModeTransmit;
    shifterConfig.inputSource   = kFLEXIO_ShifterInputFromPin;
    shifterConfig.shifterStop   = kFLEXIO_ShifterStopBitHigh;
    shifterConfig.shifterStart  = kFLEXIO_ShifterStartBitLow;

    FLEXIO_SetShifterConfig(base->flexioBase, base->shifterIndex[0], &shifterConfig);

    /*2. Configure the timer 0 for tx. */
    timerConfig.triggerSelect   = FLEXIO_TIMER_TRIGGER_SEL_SHIFTnSTAT(base->shifterIndex[0]);
    timerConfig.triggerPolarity = kFLEXIO_TimerTriggerPolarityActiveLow;
    timerConfig.triggerSource   = kFLEXIO_TimerTriggerSourceInternal;
    timerConfig.pinConfig       = kFLEXIO_PinConfigOutputDisabled;
    timerConfig.pinSelect       = base->TxPinIndex;
    timerConfig.pinPolarity     = kFLEXIO_PinActiveHigh;
    timerConfig.timerMode       = kFLEXIO_TimerModeDual8BitBaudBit;
    timerConfig.timerOutput     = kFLEXIO_TimerOutputOneNotAffectedByReset;
    timerConfig.timerDecrement  = kFLEXIO_TimerDecSrcOnFlexIOClockShiftTimerOutput;
    timerConfig.timerReset      = kFLEXIO_TimerResetNever;
    timerConfig.timerDisable    = kFLEXIO_TimerDisableOnTimerCompare;
    timerConfig.timerEnable     = kFLEXIO_TimerEnableOnTriggerHigh;
    timerConfig.timerStop       = kFLEXIO_TimerStopBitEnableOnTimerDisable;
    timerConfig.timerStart      = kFLEXIO_TimerStartBitEnabled;
    
    timerConfig.timerCompare = timerCmp;

    FLEXIO_SetTimerConfig(base->flexioBase, base->timerIndex[0], &timerConfig);


    return result;
}

status_t FLEXIO_UART_Init_rx(FLEXIO_UART_Type *base, const flexio_uart_config_t *userConfig, uint32_t srcClock_Hz)  
{
    assert((base != NULL) && (userConfig != NULL));

    flexio_shifter_config_t shifterConfig;
    flexio_timer_config_t timerConfig;
    uint32_t ctrlReg  = 0;
    uint16_t timerDiv = 0;
    uint16_t timerCmp = 0;
    uint32_t calculatedBaud;
    uint32_t diff;
    status_t result = kStatus_Success;

    /* Clear the shifterConfig & timerConfig struct. */
    (void)memset(&shifterConfig, 0, sizeof(shifterConfig));
    (void)memset(&timerConfig, 0, sizeof(timerConfig));

    
//----------------------------------------------
    
