tom38121605/rd_00_base/RD_00_语言_算法/IIS-卡车司机算法-k/SMonitor_prj_270_frm_255c_af_flexuart_SD5做tx_AD0做rx_ok_keep/devices/MIMXRT1011/drivers/fsl_flexio_uart.c
    }

    /* Send data register empty and the interrupt is enabled. */
    if ((((uint32_t)kFLEXIO_UART_TxDataRegEmptyFlag & status) != 0U) &&
        ((base->flexioBase->SHIFTSIEN & (1UL << base->shifterIndex[0])) != 0U))
    {
       
//flg_tx=1;  
//status = FLEXIO_UART_GetStatusFlags(base);        
//PRINTF("tx out irq%d\r\n",status);      
       
       
        //if (handle->txDataSize != 0U)
        {
            /* Using non block API to write the data to the registers. */
            FLEXIO_UART_WriteByte(base, handle->txData);
            handle->txData++;
            handle->txDataSize--;
           
//status = FLEXIO_UART_GetStatusFlags(base);        
//PRINTF("tx outed %d\r\n",status);      

            /* If all the data are written to data register, TX finished. */
            if (0U == handle->txDataSize)
            {
                handle->txState = (uint8_t)kFLEXIO_UART_TxIdle;

                /* Disable TX register empty interrupt. */
                FLEXIO_UART_DisableInterrupts(base, (uint32_t)kFLEXIO_UART_TxDataRegEmptyInterruptEnable);
                //FLEXIO_UART_ClearStatusFlags(base, (uint32_t)kFLEXIO_UART_TxDataRegEmptyFlag);  //--add

                /* Trigger callback. */
                if (handle->callback != NULL)
                {
                    handle->callback(base, handle, kStatus_FLEXIO_UART_TxIdle, handle->userData);
                }
            }
        }
         
    }
    
////test 
////FLEXIO_UART_ClearStatusFlags(base, (uint32_t)kFLEXIO_UART_TxDataRegEmptyFlag);      
//status = FLEXIO_UART_GetStatusFlags(base);    
//PRINTF("out irq %d\r\n",status);  

    
}
